Revit 2027 API
ElectricalDemandFactorDefinition.Create Method
 Creates a new instance of a demand factor definition.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElectricalDemandFactorDefinition Create(
	Document ADoc,
	string strName
)
Public Shared Function Create (
	ADoc As Document,
	strName As String
) As ElectricalDemandFactorDefinition
public:
static ElectricalDemandFactorDefinition^ Create(
	Document^ ADoc,
	String^ strName
)
static member Create :
        ADoc : Document *
        strName : string -> ElectricalDemandFactorDefinition
Parameters
ADoc Document
 The document where the element will be created and added.
strName String
 The name of the electrical demand factor definition to be created.
Return Value
ElectricalDemandFactorDefinition
 The newly created demand factor definition element.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace